app/views/staffs/show.html.erb


<div><%@staff.contracts.each do |contract| %>
---
SELECT "contracts".* FROM "contracts" WHERE "contracts"."staff_id" = $1  [["staff_id", 1]]