app/controllers/contracts_controller.rb

INSERT INTO "contracts" ("job_title", "salary", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["job_title", "1234"], ["salary", 12351.0], ["created_at", "2016-10-06 07:41:01.898853"], ["updated_at", "2016-10-06 07:41:01.898853"]]
---
	def create
		@contract = @staff.contracts.new(contract_params)
		if @contract.save

UPDATE "contracts" SET "commencement_date" = $1, "end_date" = $2, "updated_at" = $3 WHERE "contracts"."id" = $4  [["commencement_date", "2016-10-05 00:00:00.000000"], ["end_date", "2016-10-11 00:00:00.000000"], ["updated_at", "2016-10-10 09:26:10.257818"], ["id", 3]]
---
	def update
		@contract.update(contract_params)

UPDATE "contracts" SET "status" = $1, "updated_at" = $2 WHERE "contracts"."id" = $3  [["status", 1], ["updated_at", "2016-10-06 08:44:02.771411"], ["id", 3]]
---
	def activate
		@contract.update(status:1)

UPDATE "contracts" SET "status" = $1, "updated_at" = $2 WHERE "contracts"."id" = $3  [["status", 0], ["updated_at", "2016-10-06 08:44:22.140792"], ["id", 3]]
---
	def terminate
		@contract.update(status:0)

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT 1  [["id", nil]]
---
	def set_staff
		@staff= Staff.find(params[:staff_id])

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT 1  [["id", nil]]
---
	def set_contract
		@contract = Contract.find(params[:id])