app/controllers/departments_controller.rb

INSERT INTO "departments" ("name", "head_of_department", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Engineering"], ["head_of_department", "Tommy"], ["created_at", "2016-09-28 04:23:46.154672"], ["updated_at", "2016-09-28 04:23:46.154672"]]
---
	def create
		@department = Department.new(department_params)
		authorize @department
		if @department.save

UPDATE "departments" SET "head_of_department" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["head_of_department", "Tommy"], ["updated_at", "2016-10-06 06:34:27.784253"], ["id", 1]]
---
	def update
		@department.update(department_params)