app/controllers/invites_controller.rb

SELECT  "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT 1  [["id", 4]]
---
	def send_invitation
	  @invite = Invite.find(params[:id])