app/controllers/sessions_controller.rb

  def new
	admin_users = User.find_by(category:'admin')
---
SELECT  "users".* FROM "users" WHERE "users"."category" = $1 LIMIT 1  [["category", 0]]