app/controllers/settings_controller.rb

UPDATE "settings" SET "rules" = $1, "updated_at" = $2 WHERE "settings"."id" = $3  [["rules", "{\"work_days\":null,\"half_days\":[\"4\",\"5\"],\"off_days\":[\"6\",\"7\"]}"], ["updated_at", "2016-10-11 09:16:35.097444"], ["id", 1]]
INSERT INTO "settings" ("rules", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["rules", "\"work_days\"=>\"[]\", \"half_days\"=>\"[]\", \"off_days\"=>\"[]\""], ["created_at", "2016-10-11 08:51:02.986866"], ["updated_at", "2016-10-11 08:51:02.986866"]]
INSERT INTO "workdays" ("workdate", "full_or_half", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["workdate", "2016-10-12"], ["full_or_half", 1.0], ["created_at", "2016-10-12 02:51:49.193545"], ["updated_at", "2016-10-12 02:51:49.193545"]]
---
	def set_work_days
		original_setting_rules = @setting.rules
		#improve this!
		params[:work_days] = [] if params[:work_days] == nil
		params[:half_days] = [] if params[:half_days] == nil
		params[:off_days] = [] if params[:off_days] == nil

		@setting.update(rules:{work_days:params[:work_days],half_days:params[:half_days],off_days:params[:off_days]})

		last_day=Workday.pluck(:workdate).sort.last
		if  original_setting_rules == @setting.rules
		elsif last_day == nil || last_day < Date.today
			Setting.create_work_day_entries(@setting.rules)

SELECT "workdays"."workdate" FROM "workdays"
---
	def load_calendar
		dates = Workday.all.pluck(:workdate)

SELECT  "settings".* FROM "settings"  ORDER BY "settings"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "settings"
---
	def set_setting
		if Setting.all.empty?