app/controllers/staffs_controller.rb

	def create
		# @user = User.new(email:staff_params[:email],password: 123456,category:"staff")
		@staff = Staff.new(staff_params)
		authorize @staff
		if @staff.save
			invite= Invite.create(email:@staff.email)
---
INSERT INTO "staffs" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "staff_test_1@gmail.com"], ["name", ""], ["created_at", "2016-09-28 03:58:19.716712"], ["updated_at", "2016-09-28 03:58:19.716712"]]
INSERT INTO "invites" ("email") VALUES ($1) RETURNING "id"  [["email", "cmh114933@gmail.com"]]

	def index
		@staffs = Staff.all
		@active_staffs = []
		Contract.where(status:1).each do |contract|
			@active_staffs << Staff.find(contract.staff_id)
---
SELECT "staffs".* FROM "staffs"
SELECT "contracts".* FROM "contracts" WHERE "contracts"."status" = $1  [["status", 0]]
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT 1  [["id", nil]]

	def update
		@staff.update(staff_params)
---
UPDATE "staffs" SET "identification_document" = $1, "updated_at" = $2 WHERE "staffs"."id" = $3  [["identification_document", "[\"McDelivery__Malaysia.pdf\"]"], ["updated_at", "2016-10-05 10:26:36.949465"], ["id", 1]]

	def filter_staff_by_contracts
		contracts = Contract.where("commencement_date > ? AND end_date < ?",params[:date_from],params[:date_to])
		filtered_staffs = []
		contracts.each do |contract|
			staff = Staff.find(contract.staff_id)
			filtered_staffs << [staff,staff.attributes.values.include?(nil)]
---
SELECT "contracts".* FROM "contracts" WHERE (commencement_date > '2016-10-08' AND end_date < '2016-10-17')
SELECT "staffs".* FROM "staffs" WHERE (commencement_date > '2016-10-08', end_date < '2016-10-17')
INSERT INTO "contracts" ("commencement_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["commencement_date", "2016-10-09 00:00:00.000000"], ["end_date", "2016-10-10 00:00:00.000000"], ["created_at", "2016-10-10 09:17:16.774219"], ["updated_at", "2016-10-10 09:17:16.774219"]]

	def set_staff
		@staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT 1  [["id", 1]]