app/controllers/staffs_controller.rb

SELECT "contracts".* FROM "contracts" WHERE (end_date>'2016-10-06 02:59:12.348169')
---
	def index
		@staffs = Staff.all
		@active_staffs = []
		Contract.where("end_date>?", Time.now).each do |contract|