app/controllers/staffs_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "category", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(email:staff_params[:email],password: 123456,category:"staff")
		@staff = Staff.new(staff_params)
		authorize @staff
		if @staff.save
			@user.save