app/controllers/users_controller.rb

	def new
		@user=User.new()
		invite_code = request.original_url.split("/").last
		@invite = Invite.find_redeemable(invite_code) if invite_code != "signup"
---
SELECT  "invites".* FROM "invites" WHERE "invites"."invite_code" = $1 LIMIT 1  [["invite_code", "123"]]

	def create
		@user=User.new(user_params)
		invite_code = request.referrer.split("/").last
		@invite = Invite.find_redeemable(invite_code)
		if @invite.nil?
			authorize @user
			if @user.save
---
SELECT  "invites".* FROM "invites" WHERE "invites"."invite_code" = $1 LIMIT 1  [["invite_code", "8f62516d6f7ebb212ce364aa5789e959453936e8"]]
INSERT INTO "users" ("email", "encrypted_password", "category", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"